"""
===============Built-in functions tasks No.1===============
Откройте файл task1.txt. В нём записаны числа от 1 до 10 в столбец. Выведите первые 5 элементов в вашем файле в терминал
"""
# with open('task1.txt', 'r') as file:
#     for line in file.readlines(9):
#         print(line)

"""
===============Built-in functions tasks No.2===============
Откройте файл task2.txt. В нём записаны числа от 1 до 10 в столбец. Распечатайте все числа, не используя методы.
"""
# with open('task2.txt', 'r') as file:
#     for line in file.readlines(20):
#         print(line)

"""
===============Built-in functions tasks No.3===============
Откройте файл task3.txt в режиме записи. Запишите в него числа от 0 до 9 через символ *. Затем вернитесь в начало файла и распечатайте записанные числа.
"""


"""
===============Built-in functions tasks No.4===============
Откройте файл task1.txt. В нём записаны числа от 1 до 10 в столбец. Выведите первые 5 элементов в вашем файле в терминал
"""

"""
===============Built-in functions tasks No.5===============
Откройте файл task1.txt. В нём записаны числа от 1 до 10 в столбец. Выведите первые 5 элементов в вашем файле в терминал
"""

